## 10.1GroupBy机制

In [3]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                  'key2' : ['one', 'two', 'one', 'two', 'one'],
                  'data1' : np.random.randn(5),
                  'data2' : np.random.randn(5)})

In [5]:
df

  key1 key2     data1     data2
0    a  one  0.679780 -0.062440
1    a  two -1.455529 -1.012809
2    b  one  0.095777  0.652276
3    b  two -0.559323  0.787301
4    a  one -1.627356 -0.973786

In [6]:
grouped = df['data1'].groupby(df['key1'])

In [7]:
grouped

In [8]:
grouped.mean()

key1
a   -0.801035
b   -0.231773
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -0.473788
      two    -1.455529
b     one     0.095777
      two    -0.559323
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a    -0.473788 -1.455529
b     0.095777 -0.559323

In [12]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [13]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [14]:
df['data1'].groupby([states, years]).mean()

California  2005   -1.455529
            2006    0.095777
Ohio        2005    0.060228
            2006   -1.627356
Name: data1, dtype: float64

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.801035 -0.683012
b    -0.231773  0.719789

In [16]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.473788 -0.518113
     two  -1.455529 -1.012809
b    one   0.095777  0.652276
     two  -0.559323  0.787301

In [17]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [18]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.679780 -0.062440
1    a  two -1.455529 -1.012809
4    a  one -1.627356 -0.973786
b
  key1 key2     data1     data2
2    b  one  0.095777  0.652276
3    b  two -0.559323  0.787301

In [19]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.679780 -0.062440
4    a  one -1.627356 -0.973786
('a', 'two')
  key1 key2     data1     data2
1    a  two -1.455529 -1.012809
('b', 'one')
  key1 key2     data1     data2
2    b  one  0.095777  0.652276
('b', 'two')
  key1 key2     data1     data2
3    b  two -0.559323  0.787301

In [20]:
prices = dict(list(df.groupby('key1')))

In [21]:
prices['b']

  key1 key2     data1     data2
2    b  one  0.095777  0.652276
3    b  two -0.559323  0.787301

In [22]:
df .dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [23]:
grouped = df.groupby(df.dtypes, axis=1)

In [24]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.679780 -0.062440
1 -1.455529 -1.012809
2  0.095777  0.652276
3 -0.559323  0.787301
4 -1.627356 -0.973786
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [25]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.518113
     two  -1.012809
b    one   0.652276
     two   0.787301

In [26]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped
s_grouped.mean()

key1  key2
a     one    -0.518113
      two    -1.012809
b     one     0.652276
      two     0.787301
Name: data2, dtype: float64

In [27]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [28]:
people.iloc[2:3, [1,2]] = np.nan

In [29]:
people

               a         b         c         d         e
Joe    -0.033258  0.840987 -0.014747  0.511657 -0.539421
Steve   0.208944 -0.725116  0.358835 -0.001524  0.117350
Wes    -0.157818       NaN       NaN  1.672279 -1.537568
Jim    -1.071396  0.039129  0.756786  1.277669 -0.795079
Travis  1.590118  1.069558  0.362113 -0.247709  2.565845

In [30]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [31]:
by_column = people.groupby(mapping, axis=1)

In [32]:
by_column.sum()

            blue       red
Joe     0.496910  0.268308
Steve   0.357311 -0.398822
Wes     1.672279 -1.695386
Jim     2.034454 -1.827346
Travis  0.114404  5.225521

In [33]:
map_series = pd.Series(mapping)

In [34]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [35]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [36]:
people.groupby(len).sum()

          a         b         c         d         e
3 -1.262472  0.880116  0.742038  3.461605 -2.872067
5  0.208944 -0.725116  0.358835 -0.001524  0.117350
6  1.590118  1.069558  0.362113 -0.247709  2.565845

In [37]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [38]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.157818  0.840987 -0.014747  0.511657 -1.537568
  two -1.071396  0.039129  0.756786  1.277669 -0.795079
5 one  0.208944 -0.725116  0.358835 -0.001524  0.117350
6 two  1.590118  1.069558  0.362113 -0.247709  2.565845

In [39]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])

In [40]:
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           codes=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [41]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [42]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.003538 -1.452992  1.691095  0.504568 -0.427616
1     -0.635078  0.260210  1.205813  1.754964  1.475849
2     -0.799865 -0.432417 -0.126469 -0.376608 -0.003701
3     -0.397782  0.438595  0.510460 -0.413213 -0.426058

In [43]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## 10.2 数据聚合

In [44]:
df

  key1 key2     data1     data2
0    a  one  0.679780 -0.062440
1    a  two -1.455529 -1.012809
2    b  one  0.095777  0.652276
3    b  two -0.559323  0.787301
4    a  one -1.627356 -0.973786

In [45]:
grouped = df.groupby('key1')

In [47]:
grouped['data1'].quantile(0.9)

key1
a    0.252718
b    0.030267
Name: data1, dtype: float64

In [51]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [52]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.307136  0.950369
b     0.655100  0.135025

In [54]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.801035  1.285298 -1.627356 -1.541442 -1.455529 -0.387874
b      2.0 -0.231773  0.463226 -0.559323 -0.395548 -0.231773 -0.067998

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.679780   3.0 -0.683012  0.537785 -1.012809 -0.993298 -0.973786
b     0.095777   2.0  0.719789  0.095477  0.652276  0.686032  0.719789


           75%       max
key1
a    -0.518113 -0.062440
b     0.753545  0.787301

In [55]:
tips = pd.read_csv('G:/python/pydata-book-2nd-edition\examples/tips.csv')

In [56]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [57]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [58]:
grouped = tips.groupby(['day', 'smoker'])

In [61]:
grouped_pct = grouped['tip_pct']

In [63]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [65]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [66]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)] )

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [67]:
functions = ['count', 'mean', 'max']

In [68]:
result = grouped['tip_pct', 'total_bill'].agg(functions)

In [69]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [70]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [71]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]
grouped['tip_pct', 'total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [72]:
grouped.agg({'tip': np.max, 'size':'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [73]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],
            'size': 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

### 10.2.2返回不含索引的聚合数据